{
  "metadata": {
    "scraped_at": "2025-08-12T00:10:47.838313",
    "subject": "CUMT",
    "total_courses": 7,
    "scraper_version": "memory-safe-v2.0"
  },
  "courses": [
    {
      "subject": "CUMT",
      "course_code": "1002",
      "title": "Cultural Theories",
      "credits": "3.00",
      "terms": [],
      "description": "This course provides an introduction to cultural theories which aims to help students understand and conceptualize cultural dynamics. Taking a step by step approach, this course comprises three parts, which will guide students from the general concepts right through to the core thoughts of various schools of cultural theories. It will firstunfold an overall picture and introducethe basic concepts enshrined in the theories. It will then illustrate the developing process of cultural theories by tracing the critical moments and key authors. The final part will discuss a broad range of thoughts that come from Structuralism, Post-structuralism, Marxism, Psychoanalysis, Postmodernism etc., and the social contexts from which they arose. This course is designed especially for cultural management students,integrating cases and practices of cultural industry and popular art.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture Interactive Tutorial",
      "campus": "Main Campus",
      "academic_group": "Cultural Management Pgm Comm",
      "academic_org": "Cultural Management Pgm Comm"
    },
    {
      "subject": "CUMT",
      "course_code": "2001",
      "title": "Chinese Archaeology and Food Culture",
      "credits": "3.00",
      "terms": [
        {
          "term_code": "2390",
          "term_name": "2025-26 Term 2",
          "schedule": [
            {
              "section": "--LEC (5335)",
              "meetings": [
                {
                  "time": "Tu 10:30AM - 1:15PM",
                  "location": "Chen Kou Bun Bldg 706B",
                  "instructor": "Professor PENG Peng",
                  "dates": "6/1, 13/1, 20/1, 27/1, 3/2, 10/2"
                },
                {
                  "time": "Tu 10:30AM - 1:15PM",
                  "location": "Chen Kou Bun Bldg 706B",
                  "instructor": "Professor PENG Peng",
                  "dates": "24/2"
                },
                {
                  "time": "Tu 10:30AM - 1:15PM",
                  "location": "Chen Kou Bun Bldg 706B",
                  "instructor": "Professor PENG Peng",
                  "dates": "10/3, 17/3, 24/3, 31/3"
                },
                {
                  "time": "Tu 10:30AM - 1:15PM",
                  "location": "Chen Kou Bun Bldg 706B",
                  "instructor": "Professor PENG Peng",
                  "dates": "14/4"
                }
              ],
              "availability": {
                "capacity": "30",
                "enrolled": "0",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "30",
                "status": "Open"
              },
              "class_attributes": "Putonghua and English"
            }
          ]
        }
      ],
      "description": "Archaeology reveals many interesting findings about ancient social lives. Food has always been an essential category in human culture. The amount of food surplus determines the strength and social bonding of a society; and rituals are usually revolved around food preparation, presentation, and distribution. In China, a large number of archaeological sites contained remains of food, and occasionally drink. This course picks the representative sites to illustrate what food meant to a society that can be summarized in categories listed below: 1. Consumption of staple food: rice and noodles; 2. Perception of tastes: sweetness and bitterness; 3. Cooking methods: steaming and roasting; 4. Exotic food: what had been imported to China and when? 5. Drinks: tea and wine; 6. Rituals that involved food. This course is suitable for students who have interests in Archaeology but may not have prior knowledge about it. It aims to prepare them for exploring the past of China in the future, either in form of class teaching or self-learning, or both. The course gets students to apply the designs and innovations of ancient China in regards to food and the practice of cooking, dining and rituals to the present.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Cultural Management Pgm Comm",
      "academic_org": "Cultural Management Pgm Comm"
    },
    {
      "subject": "CUMT",
      "course_code": "2002",
      "title": "Language and Practice of Cultural Management",
      "credits": "3.00",
      "terms": [],
      "description": "The course looks into the practical as well as the critical sides of cultural management, giving students a more elaborated understanding of cultural management, covering several major areas including 1) The cultural and social implication of cultural institution and its dynamic interaction with contemporary society; 2) Mode of governance and operation of different types of cultural institutions; 3) Basic administrative and technical skills in planning and implementing various types of cultural programmes; 4) Professional ethics, social responsibilities and responsiveness to community needs. It intends to help students to build a solid technical as well as intellectual base for further specialized studies in cultural management.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Cultural Management Pgm Comm",
      "academic_org": "Cultural Management Pgm Comm"
    },
    {
      "subject": "CUMT",
      "course_code": "2013",
      "title": "Art Institutions in Twentieth-Century China",
      "credits": "2.00",
      "terms": [],
      "description": "(GENA2372 is double-coded with CUMT2013.) The course examines the correlation between art and institutions in twentieth-century China, aiming to encourage students to think about modern Chinese art through the concept of the artworld. The downfall of the Qing dynasty and the establishment of the Republican China transformed the social and institutional organisation of the production, distribution, and consumption of art as well as the traditional patronage system in modern China. The structural changes conditioned the emergence of formal and informal art institutions that facilitated yet constrained artistic practices, laying the foundation for the development of a modern art world in China. The course looks at the history of modern Chinese art and the formation of different art institutions in the sociocultural and economic context of modern China. Weekly topics are structured chronologically and thematically, which cover a wide range of themes, including art schools, art societies, museums, exhibitions, and art market. Adopting an interdisciplinary approach, the course offers students multi-perspectives to understand the transformation of modern Chinese art and the interactions between artistic practices and society in modern China.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Dept of Cultural & Rel Studies",
      "academic_org": "Dept of Cultural & Rel Studies"
    },
    {
      "subject": "CUMT",
      "course_code": "4005",
      "title": "Art and Propaganda",
      "credits": "3.00",
      "terms": [],
      "description": "The course studies the history, theories and techniques of organizing cultural activities for social and political causes. It investigates the relationship between cultural expressions and the infrastructure of power, and the application of arts and culture for social, political actions, covering such major movements from the avant-garde of the 19th Century, the USSR and the Chinese propaganda movements, to the arts for civil right movements since 1960s. Case studies of similar movements in Hong Kong will also be included. The final part of the course will introduce to students the operational and managerial skill required for organizing such cultural activities.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Cultural Management Pgm Comm",
      "academic_org": "Cultural Management Pgm Comm"
    },
    {
      "subject": "CUMT",
      "course_code": "4102",
      "title": "Research Project",
      "credits": "3.00",
      "terms": [
        {
          "term_code": "2390",
          "term_name": "2025-26 Term 2",
          "schedule": [
            {
              "section": "-M01-TMC (6185)",
              "meetings": [
                {
                  "time": "TBA",
                  "location": "No Room Required",
                  "instructor": "Staff",
                  "dates": "05/01/2026 - 13/04/2026"
                }
              ],
              "availability": {
                "capacity": "30",
                "enrolled": "0",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "30",
                "status": "Open"
              },
              "class_attributes": "Cantonese and English Capstone Course"
            }
          ]
        }
      ],
      "description": "Students are required to take either this course or “CUMT4103 Internship” to fulfill the capstone course requirements of the Programme. In this course, students are expected to be able to integrate the knowledge and skills that they learnt into a research project. This course has two specific objectives. First, it aims to allow the students to experience completing a coherent research project either by participating in faculty-directed projects as a research group member or conducting independent research under supervision. Second, it will help students develop the preliminary idea of applying theories to answering research questions. This can be done by adopting a constructivist approach with cultural theories to account for a certain phenomenon pertinent to cultural management, or by identifying resolutions based on positive social science theories for cultural management. A faculty member will be assigned based on the student’s area of interest for the research project.",
      "enrollment_requirement": "",
      "course_attributes": "Capstone Course",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Thesis Monitoring Course",
      "campus": "Main Campus",
      "academic_group": "Cultural Management Pgm Comm",
      "academic_org": "Cultural Management Pgm Comm"
    },
    {
      "subject": "CUMT",
      "course_code": "4103",
      "title": "Internship",
      "credits": "3.00",
      "terms": [
        {
          "term_code": "2380",
          "term_name": "2025-26 Term 1",
          "schedule": [
            {
              "section": "-F01-FLD (9067)",
              "meetings": [
                {
                  "time": "TBA",
                  "location": "No Room Required",
                  "instructor": "Staff",
                  "dates": "01/09/2025 - 24/11/2025"
                }
              ],
              "availability": {
                "capacity": "25",
                "enrolled": "12",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "13",
                "status": "Open"
              },
              "class_attributes": "Cantonese and English Capstone Course"
            }
          ]
        }
      ],
      "description": "Students are required to take either this course or “CUMT4102 Research Project” to fulfill the capstone course requirements of the Programme. This course has two specific objectives. First, it aims to assist the students’ understanding of the way that cultural organizations or institutions operate. Students will acquire the chance to observe the organization’s administrative structure with regard to the external policy environment, its strategies for development, partnership with other organizations, the management styles, approaches and methods and decision-making procedures. Second, it will allow students to gain the experiences through the transition from classroom learning to in-practice learning. Students are expected to reflect their learned knowledge with the live cases during the intern and apply professional norms to assess the functionalities and performances of the organization. Recommendations for improvements based on identified challenges and problems that the organization faces will be included into their final reports. A faculty member will be assigned based on the student’s area of interest for the internship.",
      "enrollment_requirement": "",
      "course_attributes": "Capstone Course",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Field Studies/Field-trip",
      "campus": "Main Campus",
      "academic_group": "Cultural Management Pgm Comm",
      "academic_org": "Cultural Management Pgm Comm"
    }
  ]
}