{
  "metadata": {
    "scraped_at": "2025-08-26T16:58:04.434154+00:00",
    "subject": "UGCP",
    "subject_title": "China Programme",
    "total_courses": 2,
    "scraper_version": "memory-safe-v2.0"
  },
  "courses": [
    {
      "subject": "UGCP",
      "course_code": "1001",
      "title": "Understanding China",
      "credits": "1.00",
      "terms": [
        {
          "term_code": "2380",
          "term_name": "2025-26 Term 1",
          "schedule": [
            {
              "section": "-X01-WBL (8641)",
              "meetings": [
                {
                  "time": "TBA",
                  "location": "No Room Required",
                  "instructor": "Staff",
                  "dates": "01/09/2025 - 24/11/2025"
                }
              ],
              "availability": {
                "capacity": "2400",
                "enrolled": "783",
                "waitlist_capacity": "999",
                "waitlist_total": "0",
                "available_seats": "1617",
                "status": "Open"
              },
              "class_attributes": "Putonghua and English"
            }
          ]
        },
        {
          "term_code": "2390",
          "term_name": "2025-26 Term 2",
          "schedule": [
            {
              "section": "-X01-WBL (8584)",
              "meetings": [
                {
                  "time": "TBA",
                  "location": "No Room Required",
                  "instructor": "Staff",
                  "dates": "05/01/2026 - 13/04/2026"
                }
              ],
              "availability": {
                "capacity": "2400",
                "enrolled": "0",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "2400",
                "status": "Open"
              },
              "class_attributes": "Putonghua and English"
            }
          ]
        }
      ],
      "description": "The history of China is both rich and complex, as is its development in the modern era. The growing influence of China on the world stage, as one of the largest economies, a prominent player in international relations, and a major centre for knowledge creation, highlights the need for an integrated and multi-disciplinary understanding of its past and present. This course brings together several perspectives on China in addressing the following topics: cultural and intellectual roots, epochal events in history, modernisation and social change, economic development, and science and technology. This online course is required of all undergraduates admitted in 2022-23 and thereafter.",
      "enrollment_requirement": "",
      "course_attributes": "Virtual Teaching & Learning Course",
      "academic_career": "Undergraduate",
      "grading_basis": "Distinction/Pass/Failure",
      "component": "Web-enhanced Teaching",
      "campus": "Main Campus",
      "academic_group": "Office of University GE",
      "academic_org": "Office of University GE",
      "learning_outcomes": "Students enrolled in this course will\n(\n1) acquire a basic understanding of selected key cultural concepts that have shaped individuals and society in Chinese history, with reference to the Confucian, Daoist and Buddhist traditions;\n(2) gain an appreciation of the complex forces that have impacted historical development in China and contributed to unity and division, the cultural and ethnic diversity of the nation, as well as continuities between past and present in government institutions, in the relations between China and the West, and in the historical-mindedness of the people;\n(3) develop a basic grasp of the modernisation of China as a movement of national salvation and self-empowerment involving giant social transformations, the emergent role and influence of China as an important member of the international community, and the concept of modernity in relation to Westernisation and globalisation;\n(4) become familiar with selected milestones in the economic development of China in the last two centuries, in particular the period since the founding of the People’s Republic, and future challenges in sustainable development;\n(5) acquire a basic knowledge of the major scientific and technological advances in ancient and modern China, with an understanding of the significance of these achievements as well as their limitations from a comparative cultural perspective in the study of scientific discoveries;\n(6) develop an understanding of the phenomenon of China rising in the broader context of Chinese culture and history, and reflect on how one may respond to the challenges of China;\n(7) enhance awareness of cultural differences, leading to further reflections of one’s own cultural identity;\n(8) d\nevelop\na deepened appreciation of the complexity, grandeur and richness of Chinese history and culture, and with it a potentially enhanced sense of national identity.",
      "course_syllabus": "I.\nIntroduction\nThe introductory lecture will articulate the objectives of this core requirement in the context of the history and mission of CUHK, as well as the challenges facing Hong Kong as a special administrative region of China and as a major international metropolis in an increasingly globalized world. It will outline the different themes and topics to be covered, and how they contribute to the overall structure of the course.\nII.\nUnderstanding China: Intellectual Foundations\nCulture has significant transformative power on the individual and society. It informs identity and the collective imagination. It shapes beliefs and values. In the Chinese context, the influence of Confucian, Daoist and Buddhist traditions has been deep-rooted and pervasive, finding expression in every level of Chinese society and every level of Chinese life, in ethics and religion, laws and government, education and science, art and architecture and other aspects of material culture, and shaping the ways in which people relate to each other, and how they view the world. Selected core concepts which figure prominently in the Chinese intellectual and cultural tradition will be critically examined, including the concepts of order and harmony, the\njunzi\n- ideal person,\nren\nor benevolence and empathetic concern,\nli\nor ritual and propriety, and\ndao\nor the way. These ideas provide an entry into a world of ideas that is not only critical to understanding China but also significant to global dialogue.\nIII.\nHistory as Mirror: Looking at Today’s China from the Past\nThe purpose of this part of the course is not to rehearse the history of China, but to explore the recurrent themes and conceptual underpinnings that fuel and impact the remarkable phenomenon of China rising. We will examine five themes: (a) The grand unification of the Qin dynasty, and the central government and the standardization measures it introduced; (b) The Silk Road, consisting of a network of commercial and cultural cities leading from the ancient capitals of China through India and Central Asia all the way to the Mediterranean Coast, revealing the many-faceted and multi-levelled relations between China and the West; (c) Tang Cosmopolitanism, representing a golden age of cultural development which embraced an open-door policy, with the Chinese capital serving as a major centre of art, literature, philosophy and religion in Asia; (d) The Confucian Civil Service Examination, a three-tiered examination system administered at the local, provincial and national levels, which served for centuries as a method of recruiting civil officials, and can be said to be a model of participatory equality and meritocracy; and (e) The century of humiliation, covering the period of intervention and subjugation of the Qing Dynasty and the Republic of China by Western Powers and Japan, from the Opium War to the founding of the People’s Republic of China in 1949.\nIV.\nChina’s Road to Modernisation\nThe multi-faceted process of modernisation and social change demands careful attention. The modernisation of China can be distinguished from that of the Western nations in its being a historical movement of national salvation and self-empowerment, and also as a historical struggle to become one of the multiple centres of the world from a position of the periphery. From the perspective of social change, the country’s modernisation involved giant transformations from an agricultural civilisation to an industrial one, from a monarchy to a republic, and from the study of Confucian classics to the study of science, in a leap from “tradition” to “modernity”. This part of the course will discuss the underlying patterns of Chinese modernisation in relation to selected historical events of late Qing and Republican China, as well as the reforms of the People’s Republic of China, addressing issues such as the relationship between modernisation and Westernisation, and the possibility of different forms of modernity in the context of globalisation.\nV. The Chinese Economy: Past, Present and Future\nThis part of the course looks at the Chinese economy in the context of the global economy. It reviews the economic development of China from the late Qing period to the present day, comparing it to the economy of other nations and with a focus on the developments since the founding of the People’s Republic of China, as well as projections for the future. The review makes reference to a wide range of economic indicators, including Gross Domestic Product (GDP) growth, employment, imports and exports, income distribution, national savings, and infrastructure investment, as well as development strategies such as the dual-circulation economic development strategy and the internationalisation of the Renminbi. The lecture will also examine indicators related to sustainable development such as literacy and educational attainments, public health, prevention of climate change, air and water quality and the eradication of extreme poverty.\nVI.\nScience and Technology in China\nIn the twenty-first century, science and technology are becoming an increasingly important facet of modernization for China, driving first an industrial and then an innovation economy, with major impacts on improving livelihood and in geopolitical competition. The topics covered in this part of the course include the Four Great Inventions, mathematics and astronomy in ancient and medieval China, and the question raised by Needham on why modern science emerged in Europe but not in China. Developments since the late Ming period are discussed with reference to science brought by missionaries, and the political, social and cultural reforms from the mid-19\nth\ncentury onwards. A critical examination will be provided of two recent periods, which saw achievements in a few centrally directed projects starting in the 1960s, and advances across a broad front since about 1980, but showing weaknesses in some sectors.",
      "assessment_types": {
        "Examination": "90",
        "Homework or assignment": "10"
      },
      "feedback_evaluation": "Course and teaching evalution survey.",
      "required_readings": "I. Understanding China: Intellectual Foundations\nCsikszentmihalyi, Mark. 2020. Confucius.\nThe Stanford Encyclopedia of Philosophy\n, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/sum2020/entries/confucius/>\nChan, Alan. 2018. Laozi.\nThe Stanford Encyclopedia of Philosophy\n, edited by Edward N. Zalta.\n<https://plato.stanford.edu/archives/win2018/entries/laozi/> (Parts 1, 2, 5, 6, 7)\nII. History as Mirror: Looking at Today’s China from the Past\nBaaquie, Belal Ehsan and Qing-hai Wang. 2018. Chinese Dynasties and Modern China: Unification and Fragmentation.\nChina and the World: Ancient and Modern Silk Road\n, Vol. 1, No.1, 1-43.\nIII. China’s Road to Modernisation\nKing, Ambrose Y. C. 2018. “Modernization” and “Modernity”: The Construction of a Modern Chinese Civilizational Order.\nChina’s Great Transformation: Selected Essays on Confucianism, Modernization, and Democracy\n, 111-128. Hong Kong: The Chinese University of Hong Kong Press.\nIV. The Chinese Economy: Past, Present and Future\nLau, Lawrence J. 2022. Public Goods Provision and Chinese Economic Development.\nChina and the World: Ancient and Modern Silk Road\n, Vol. 5, No. 1, 2250002. (34 pages)\nLau, Lawrence J. 2022. The Prospects of the Chinese Economy. Special issue in celebration of the Centenary of Prof. YANG Chen-Ning,\nTwenty-First Century Bimonthly\n(\n二十一世紀評論\n), October 2022.\nV. Science and Technology in China\nYoung, K. 2022. Science and Technology in China: Required Reading. Manuscript, The Chinese University of Hong Kong. (39 pages)",
      "recommended_readings": "I. Understanding China: Intellectual Foundations\nChan, Wing-Tsit. (1963) 2008. The Lao Tzu (Tao-Te Ching). In\nA Source Book in Chinese Philosophy\n. Translated and compiled by Wing-Tsit Chan. Princeton: Princeton University Press.\nLau, D.C. (1992) 2010.\nConfucius: The Analects\n. 2nd ed. Third Printing. Hong Kong: The Chinese University of Hong Kong Press.\nHershock, Peter. 2019. Chan Buddhism.\nThe Stanford Encyclopedia of Philosophy\n, edited by Edward N. Zalta. <https://plato.stanford.edu/archives/spr2019/entries/buddhism-chan/>.\nII. History as Mirror: Looking at Today’s China from the Past\nAuyang, Sunny Y. 2014.\nThe Dragon and the Eagle: The Rise and Fall of the Chinese and Roman Empires.\nArmonk, New York: M.E. Sharpe.\nDe Bary, William Theodore, ed. 1960.\nSources of Chinese Tradition.\nNew York: Columbia University Press.\nElman, Benjamin. 2010.\nA Cultural History of Civil Service Examinations in Late Imperial China\n. Berkeley and Los Angeles: University of California Press.\nFairbank, John King. 1992.\nChina: A New History\n. Cambridge, MA: Harvard University Press.\nFang, Y.H. 1986.\nThe Making of the Third Superpower\n. Hong Kong: Eastern Era Publisher.\nLewis, Mark Edward. 2009.\nChina’s Cosmopolitan Empire: The Tang Dynasty\n. Cambridge, MA: Harvard University Press.\nLi, Xiaobing and Xiansheng Tian, eds. 2014.\nEvolution of Power: China’s Struggles, Survival, and Success\n. Lexington, Maryland: Lexington Books.\nLiu, Xinru. 2010.\nThe Silk Road in World History\n. New York: Oxford University Press.\nPines, Yuri et al. 2014.\nBirth of An Empire: The State of Qin Revisited.\nBerkeley and Los Angeles: University of California Press.\nRojas, Carlos. 2010.\nThe Great Wall: A Cultural History.\nCambridge, MA: Harvard University Press.\nSheridan, James E. 1975.\nChina in Disintegration.\nNew York: The Free Press.\nTwitchett, Denis and John K. Fairbank, eds. 1986-1989.\nThe Cambridge History of China\n, Vol. I, II, X, XI. London: The Cambridge University Press.\nXiong, Victor Cunrui and Kenneth J. Hammond. 2019.\nRoutledge Handbook of Imperial Chinese History\n. London: Routledge.\nIII. China’s Road to Modernisation (to be provided)\nArticles:\n金耀基\n, 2013,\n中國「現代轉向」的漫長革命\n,\n《中國的現代轉向》\n, 1-30\n頁\n,\n香港：牛津大學出版社。\n金耀基\n, 2013,\n全球化，多元現代性和中國對新文明秩序的追尋\n,\n《中國的現代轉向\n》\n, 169-180\n頁\n,\n香港：牛津大學出版社。\n金耀基\n, 2013,\n文化自覺、全球化與中國現代性之構建\n,\n《中國的現代轉向》\n, 181-198\n頁\n,\n香港：牛津大學出版社。\n金耀基\n, 1989,\n天安門悲劇事件的解讀\n,\n《神州悲劇的沉思\n: 1989\n年天安門事件評析》\n,\n臺北：正中書局。\n金耀基\n, 2020,\n中國百年學術之變與發展：從經學到科學的範式轉變\n,\n《百年中國學術與文化之變\n:\n探索中國的現代文明秩序》\n, 14-27\n頁\n,\n香港：中華書局香港有限公司。\n金耀基\n, 2013,\n中國文化意識之變與反思\n,\n《中國社會與文化》\n,\n香港：牛津大學出版社。\n金耀基\n, 2013.\n中國現代文明秩序的耕建：論中國的「現代化」與「現代性」\n,\n《中國社會與文化》\n,\n香港：牛津大學出版社。\n金耀基\n, 2014,\n現代性論辯與中國社會學的定位\n,\n《社會學與中國研究》\n,\n香港：\n牛津大學出版社。\n金耀基\n, 2013,\n中國現代化的終極願景\n,\n《\n中國現代化的終極願景\n:\n金耀基自選集》\n, 88-94\n頁：上海\n;\n上海人民出版社。\nKing, Ambrose Y. C. 1997. Confucianism, Modernity and Asian Democracy. Justice and Democracy: Cross-Cultural Perspectives, edited by Ron Bontekoe, Marietta Stepaniants, Honolulu. Hawaii: University of Hawai'i Press.\nKing, Ambrose Y. C. 2002. The Emergence of Alternative Modenity in East Asia. Reflections on Multiple Modernities : European, Chinese and Other Interpretations, edited by Dominic Sachsenmaier and Jens Riedel, with Shmuel N. Eisenstadt. Multiple Modernities Conference. Leiden; Boston, Mass.: Brill.\nPfeffer, Richard M. 1997. The Pursuit of Purity: Mao's Cultural Revolution. China in Ferment; Perspectives on the Cultural Revolution. Richard Baum edited, with Louise B. Bennett. Englewood Cliffs, N.J. : Prentice-Hall.\nInglehart, R., Baker, W. E. Modernization.2000. Cultural Change, and the Persistence of Traditional Values. American Sociological Review, vol. 65.\nHavel, Vaclav. 1995. Civilization's Thin Veneer. Harvard Magazine, vol. 97.\nEisenstadt, S. N. 2000. Multiple Modernities in an Age of Globalization. Truman Institute Reprints (n.d) Jerusalem: The Hebrew University.\nBooks:\n金耀基\n, 2013,\n《中國政治與文化》\n,\n香港：牛津大學出版社。\n金耀基\n, 2014,\n《\n社會學與中國研究》\n,\n香港：\n牛津大學出版社\n,\n。\n金耀基\n, 2016,\n《\n中國文明的現代轉型》\n,\n廣州：\n廣東人民出版社\n,\n。\n金耀基\n, 2017,\n《\n從傳統到現代》\n,\n北京：北京法律出版社\n,\n。\n亨利．\n.\n基辛格\n, 2019,\n《論中國》\n,\n胡利平\n,\n林華\n,\n楊韻琴\n,\n朱敬文譯\n.\n北京：中信出版社。\n郭廷以\n, 1979,\n《\n中國近代史綱》\n,\n香港：香港中文大學出版社。\n埃里克．伊茲拉萊維奇\n(Erik Izraelewicz), 2006,\n《當中國改變世界》\n,\n姚海星\n,\n斐曉亮譯\n,\n臺北：高寶。\n馬丁・雅克\n(Martin Jacques), 2010,\n《當中國統治世界\n:\n中國的崛起和西方世界的衰落》\n,\n張莉、劉曲譯\n,\n北京：中信出版社。\n法理德．劄卡瑞亞\n(Fareed Zakaria), 2008,\n《後美國世界\n:\n群雄崛起的經濟新秩序時代》\n,\n杜默譯\n,\n台北市：\n麥田出版。\n許倬雲\n, 2014,\n《現代文明的批判\n:\n剖析人類未來的困境》\n,\n台北市：\n遠見天下文化出版。\nKing, Ambrose Y. C. 2018. China's Great Transformation: Selected Essays on Confucianism, Modernization, and Democracy. Hong Kong: The Chinese University Press.\nFukuyama, Francis. 1992. The End of History and the Last Man. New York: Free Press.\nHuntington, Samuel. 2011. The Clash of Civilization and the Remaking of World Order. New York: Simon & Schuster.\nFriedman, Thomas L. 2005. The World is Flat: A Brief History of the Globalized World in the Twenty-first Century. London: Allen Lane.\nIV. The Chinese Economy: Past, Present and Future\nLau, Lawrence J. 2019.\nThe China-U.S. Trade War and Future Economic Relations\n. Hong Kong: The Chinese University of Hong Kong Press.\nV. Science and Technology in China\nYoung, K. 2022. Science and Technology in China: Supplementary Reading. Manuscript, The Chinese University of Hong Kong. (106 pages)"
    },
    {
      "subject": "UGCP",
      "course_code": "1002",
      "title": "Hong Kong in the Wider Constitutional Order",
      "credits": "1.00",
      "terms": [
        {
          "term_code": "2380",
          "term_name": "2025-26 Term 1",
          "schedule": [
            {
              "section": "-X01-WBL (8602)",
              "meetings": [
                {
                  "time": "TBA",
                  "location": "No Room Required",
                  "instructor": "Staff",
                  "dates": "01/09/2025 - 24/11/2025"
                }
              ],
              "availability": {
                "capacity": "2400",
                "enrolled": "1057",
                "waitlist_capacity": "999",
                "waitlist_total": "0",
                "available_seats": "1343",
                "status": "Open"
              },
              "class_attributes": "Cantonese, English and Putonghua"
            }
          ]
        },
        {
          "term_code": "2390",
          "term_name": "2025-26 Term 2",
          "schedule": [
            {
              "section": "-X01-WBL (8823)",
              "meetings": [
                {
                  "time": "TBA",
                  "location": "No Room Required",
                  "instructor": "Staff",
                  "dates": "05/01/2026 - 13/04/2026"
                }
              ],
              "availability": {
                "capacity": "2400",
                "enrolled": "0",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "2400",
                "status": "Open"
              },
              "class_attributes": "Cantonese, English and Putonghua"
            }
          ]
        }
      ],
      "description": "This course views the overall development of Hong Kong from the perspectives of the nation and the wider constitutional order in China. It highlights the interlocking relations between law, national security and national development in the context of state capacity building in modern Chinese history, and introduces the fundamental constitutional principles underlying the One-Country-Two-Systems framework, the Basic Law of Hong Kong, and the Hong Kong National Security Law. This online course is required of all undergraduates admitted in 2022-23 and thereafter. It is recommended that students complete the online course UGCP1001 “Understanding China” before taking this course.",
      "enrollment_requirement": "",
      "course_attributes": "Virtual Teaching & Learning Course",
      "academic_career": "Undergraduate",
      "grading_basis": "Distinction/Pass/Failure",
      "component": "Web-enhanced Teaching",
      "campus": "Main Campus",
      "academic_group": "Office of University GE",
      "academic_org": "Office of University GE",
      "learning_outcomes": "Students enrolled in this course will be able to:\n1. Articulate the concept of “constitutional order” and the importance of understanding the position of Hong Kong in the wider constitutional order of China and the special administrative region;\n2. Describe the dimensions of state capacity and its crucial role in the economic development of China;\n3. Explain how the loss of Hong Kong in the wake of the Opium war is a symbol of state failure, as well as the historical roots of the rise of national insecurity from the mid-19th century onwards;\n4. Describe the strategic objectives of China in adopting the One-Country-Two-Systems framework and the central tenets of the framework;\n5. Describe the key features of the Hong Kong Basic Law and explain how it relates to the Constitution of the People’s Republic of China;\n6. Identify types of insecurity in the contemporary world that are related to national security;\n​\n7. Describe the principles and key features of HKNSL;\n8. Recognise a broader notion of HKNSL as an integral part of China’s constitutional system, which promotes multiple national developmental goals and pluralistic general principles for security and development in the region and the whole nation.",
      "course_syllabus": "Introduction\nThe introduction will highlight the importance of understanding the constitutional foundation of Hong Kong within the larger context of China’s constitutional order. The educational rationale for the course will be articulated. The different themes and topics to be covered, and how they contribute to the overall structure of the course, will be outlined.\nModule I: Basic Concepts and Themes\nThis module introduces several basic concepts and themes relevant to our understanding of the position of Hong Kong within the wider constitutional order of China. A brief historical perspective is provided on the influence of Chinese culture on the Chinese legal system, and the interlocking relationship between state capacity building, the Constitution of the People’s Republic of China, the One-Country-Two-Systems framework, and national security. Some issues pertaining to the intricate relationship between the National Constitution and the Hong Kong Basic Law are explored. The module ends with a note on the growing awareness in the world of security issues confronting all nations and societies, the importance of safeguarding national security, and the emergence of national security as a subfield of academic study.\nModule II: China’s Rise: a Bicentennial Perspective\nII-1. State Capacity and Economic Development\nThe first lecture of Module II introduces the concept of “state capacity”, broadly understood as the ability of the state to turn its will into action and reality, in particular the building of infrastructural capacity. It is argued that state capacity provides the pivotal foundation for economic development, and played an important role in the development of early modern economies. The concept of “state capacity” helps explain the Great Divergence between the West and the rest of the world in the 18th and 19th centuries, and the difference in the developmental paths of Japan and China from the mid-19th century onwards.\nII-2. The Decline of Old China\nThe second lecture of Module II analyses the decline of China during the period from the time of the Opium War to the founding of the People’s Republic of China from the perspective of state capacity. It is argued that the decline of China during this period, or “Old China”, can be attributed to its weak and eroded infrastructural capacity, as reflected in its weak coercive capacity, extractive capacity and assimilative capacity. In terms of the state’s ability to maintain law and order, its Gross Domestic Product (GDP) per capita level, and its capacity to provide for education and public health, Old China ranked below most developing nations, and showed characteristics of what may be called a “failed state”.\nII-3. The Rise of New China and its Global Implications\nThe third lecture of the module analyses the economic development of “New China” through a review of the unprecedented state capacity of the People’s Republic of China, as seen in the formulation, implementation, and execution of its nationwide policies. The successful transformation of China, the most populous nation which at one point ranked rock bottom in the world in terms of development, carries significant global implications which will be explored in the lecture.\nII-4. “The March of the Volunteers”: The Birth of the National Anthem\nThe module concludes with a lecture that traces the socio-historical origins of “The March of the Volunteers” to a film, its composer, and the introduction of communal singing into China, as well as its reception in the West.\nModule III: One Country, Two Systems: Past and Present\nIII-1. The Constitution of New China\nThe first lecture of Module III introduces us to some of the salient features of the Constitution of the People’s Republic of China. The general concept of a unitary state is introduced, referring to a system of central and local governments, with the latter deriving the rights of local autonomy from the authorization by the central government and having the obligation to preserve and defend the unity of the country. The ancient Chinese constitutional wisdom in implementing “one country, many systems” under the rubric of a unitary state sheds light on the historical and constitutional foundation for both “one country” and “two systems”.\nIII-2. One Country, Two Systems: its Strategic Objectives and Core Features\nCritical to our understanding of Hong Kong in the wider constitutional order is developing an in-depth and comprehensive understanding of the “One Country, Two Systems (OCTS)” policy. The second lecture of Module III introduces the historical background for China’s policy toward the United Kingdom after establishing the People’s Republic in 1949, and in China’s negotiations with the British leading to the return of Hong Kong’s sovereignty to China. It also discusses the key tenets of OCTS from the perspective of current-day Hong Kong.\nIII-3. The Constitution of PRC, The Basic Law of HKSAR and “One Country, Two Systems”\nThe third and concluding lecture of the module focuses on the Hong Kong Basic Law, which is a national law of China. About one-fifth of the 160 articles of the Hong Kong Basic Law contain the term “the central government”. These articles substantiate the principle of “One Country” within the text of the HK Basic Law, highlighting the pivotal importance of these articles in maintaining the wider constitutional order.\nModule IV: National Security in the Wider Constitutional Order\nIV-1. Dimensions of National Security\nThe first component of Module IV covers two topics related to dimensions of national security.\nIV-1A. Financial Security: Financial S\ntability of Hong Kong\nThe first topic focuses on financial stability. Factors that contribute to financial (in)stability are examined, making reference to the financial crises experienced in the 1980s and 1990s, as well as policies that will safeguard financial stability in Hong Kong.\nIV-1B. Information Security: The Bigger Picture-Do You Trust Your Big Data?\nThe second topic addresses the issue of information security. The complexity of keeping data secure, guarding against misinformation and disinformation, and ensuring confidentiality, integrity and availability, is highlighted with reference to Big Data and Artificial Intelligence.\nIV-2. The Constitution and National Security\nThe second component of Module IV examines the relationship between national security and the Constitution. National security is an inherent aspect of the constitutional order, and it is a misconception to think of a national security law merely as a criminal law or an emergency law.\nIV-3. Law as Safeguard: General Principles of HKNSL\nThe third component of the module guides students in learning about The Law of the People’s Republic of China on Safeguarding National Security in the Hong Kong Special Administrative Region (HKNSL) by focusing on its general principles. The innermost essence of this law is about the central government’s overarching responsibility in safeguarding national security for all Chinese, country-wide and region-wide. HKNSL also safeguards the authority of the HKSAR government to lawfully guard national sovereignty, unity, territorial integrity, and other major national security interests in Hong Kong.\nIV-4. National Security Framework Cases\nThe fourth and final component of the module discusses some recent court cases pertaining to HKNSL and the constitutional significance of these cases.",
      "assessment_types": {
        "Examination": "80",
        "Homework or assignment": "20"
      },
      "feedback_evaluation": "Course and teaching evaluation survey.",
      "required_readings": "Required Readings\nII. China’s Rise: A Bicentennial Perspective\nII-1. State Capacity and Economic Development\nII-2. The Decline of Old China\nII-3. The Rise of New China and its Global Implications\nWang, Shaoguang. 2021.\nChina’s Rise and Its Global Implications,\n1-14; 69-86; 131-154. Singapore: Springer Nature.\nII-4. “The March of the Volunteers”: The Birth of the National Anthem\nTang, Xiaobing. 2016. Street Theater and Subject Formation in Wartime China: Toward a New Form of Public Art.\nCross-Currents: East Asian History and Culture Review\n, No. 18, March 2016.\nIII. One Country, Two Systems: Past and Present\nIII-1. The Constitution of New China\n李林、莫紀宏等，\n2014\n，\n第四章，中國的憲法法律制度，\n《中國法律制度》，北京：中國社會科學出版社。\n(Li, Lin. ed. 2018. China’s constitutional law system.\nInterpreting China’s legal system\n, trans. by Cao Li, Ch. 4, 135-161. Singapore: World Scientific.)\nIII-2. One Country, Two Systems: its Strategic Objectives and Core Features\n劉兆佳\n，\n2015\n，\n“\n一國兩制\n”\n的基本內涵與目標\n，《一國兩制在香港的實踐》\n，\n19-68\n頁\n，香港：商務印書館\n。\n(\nLau, Siu-kai.\n2017. The Basic Connotations and Objectives of “One Country, Two Systems”.\nThe Practice of “One Country, Two Systems” Policy in Hong Kong\n, 20-77. Hong Kong: The Commercial Press (HK) Ltd.\n)\nChen,\nAlbert H. Y.\n2021. The Theory and Practice of Autonomy: The Case of Hong Kong. In\nThe changing legal orders in Hong Kong and Mainland China: essays on “One Country, Two Systems”\n, 57-68. Hong Kong: City University of Hong Kong Press.\nIII-3. The Constitution of PRC, The Basic Law of HKSAR and “One Country, Two Systems”\nThe Constitution of the People’s Republic of China, The Basic Law of The Hong Kong Special Administrative Region of The People’s Republic of China.\nHong Kong: The Constitutional and Mainland Affairs Bureau. May 2021.\nIV. National Security in the Wider Constitutional Order\nIV-1A. Financial Security: Financial S\ntability of Hong Kong\nBruno, Cabrillac, Macaire Camille, and De la Serve Marie-Elisabeth. 2022. The remarkable resilience of Hong Kong’s exchange rate regime.\nBanque de France Bulletin,\n239/4, January-February 2022.\nhttps://publications.banque-france.fr/en/remarkable-resilience-hong-kongs-exchange-rate-regime\nIV-2. The Constitution and National Security\nChen, Albert H. Y. 2020. Hong Kong in China: The Project of ‘One Country, Two Systems’ and the Question of National Security. In\nChina’s National Security: Endangering Hong Kong’s Rule of Law?\nEdited by Chan Cora and Fiona de Londras, 19-40. Oxford: Hart Publishing. (\n中文版參見：\n2022\n，\n‘\n一國兩制\n’\n在香港特別行政區的實踐，《憲法、香港基本法與香港國安法十講》陳弘毅、韓大元、楊曉楠主編，\n67-88\n頁香港：中華書局。\n)\nIV-3.\nLaw as Safeguard: General Principles of HKNSL\n《中華人民共和國香港特別行政區維護國家安全法》\n：\nhttps://flk.npc.gov.cn/detail.html?ZmY4MDgwODE3MmI1ZjI0ZjAxNzMwOTQxNzRkZTI1MWU%3D\nThe Law of the People’s Republic of China on Safeguarding National Security in the Hong Kong Special Administrative Region\n.\nChen, Albert H. Y. 2021. The National Security Law of the HKSAR: A Contextual and Legal Study (November 7, 2021).\nUniversity of Hong Kong Faculty of Law Research Paper\nNo. 2021/048.\nhttp://dx.doi.org/10.2139/ssrn.3958261",
      "recommended_readings": "I. Basic Concepts and Themes\n2018，《中華人民共和國憲法、中華人民共和國香港特別行政區基本法及相關法律文件》， 香港：三聯書店。\n《中華人民共和國憲法》： https://www.basiclaw.gov.hk/tc/constitution/index.html\n《中華人民共和國香港特別行政區基本法》：https://www.basiclaw.gov.hk/tc/basiclaw/index.html\n《中華人民共和國香港特別行政區維護國家安全法》：https://flk.npc.gov.cn/detail.html?ZmY4MDgwODE3MmI1ZjI0ZjAxNzMwOTQxNzRkZTI1MWU%3D\nThe Constitution of the People’s Republic of China, The Basic Law of The Hong Kong Special Administrative Region of The People’s Republic of China. Hong Kong:\nThe Constitutional and Mainland Affairs Bureau. May 2021. https://www.basiclaw.gov.hk/filemanager/content/en/files/basiclawtext/basiclaw_full_text.pdf\n《中華人民共和國政府和大不列顛及北愛爾蘭聯合王國政府關於香港問題的聯合聲明》：https://www.cmab.gov.hk/tc/issues/jd2.htm\n陳顧遠，2017[1934] ，《中國法制史概要》，北京：商務印書館。\n陳顧遠，2005，《中國文化與中國法系—陳顧遠法律史論集》，范忠信、尤陳俊、翟文喆等編校，北京：中國政法大學出版社。\n郝鐵川，1997，《中華法系研究》，上海：復旦大學出版社。\n李林、莫紀宏等，2014，《中國法律制度》，北京：中國社會科學出版社。\nLi, Lin. ed. 2018.\nInterpreting China’s legal system\n, trans. by Cao, Li. Singapore: World Scientific.\nMerryman, John H. 1985.\nThe civil law tradition: an introduction to the legal systems of Europe and Latin America.\nSecond edition. Stanford: Stanford University Press.\n蘇力，2018，《大國憲制：歷史中國的制度構成》，北京：北京大學出版社。\nSu, Li. 2018.\nThe constitution of Ancient China\n, edited by Zhang Yongle and Daniel Bell, trans. by Edmund Ryden. Princeton, NJ: Princeton University Press.\nTushnet, Mark. 2003.\nThe new constitutional order\n. Princeton, NJ: Princeton University Press.\n王振民，2014，《中央與特別行政區關係—一種法治結構的解釋》，香港：三聯書店。\nWang, Zhenmin. 2019.\nRelationship Between the Chinese Central Authorities and Regional Governments of Hong Kong and Macao: A Legal Perspective\n, 108-141; 269-276; 291-299. Singapore: Springer Singapore.\n王振民、黃風、畢雁英等，2021，《香港特別行政區維護國家安全法讀本》，香港：三聯書店。\n王紹光，2020，《中國崛起及其世界意義》，北京：中信出版社。\nWang, Shaoguang. 2021.\nChina’s Rise and Its Global Implications\n. Singapore: Springer Nature.\nWigmore, John H. 1928.\nA panorama of the world’s legal systems\n. 3 vols. St. Paul: West Publishing Co.\n蕭蔚雲，2003，《論香港基本法》，北京：北京大學出版社。\n楊鴻烈，2009 [1930] ，《中國法律發達史》，北京：中國政法大學出版社。\n張晉藩，2010，《中華法系研究論集》，北京：中國政法大學出版社。\n張晉藩，2005，《中國法律的傳統與近代轉型》，第二版，北京：法律出版社。\nZhang, Jinfan. 2014.\nThe tradition and modern transition of Chinese law\n, trans. by Zhang Lixin. New York: Springer.\nII. China’s Rise: A Bicentennial Perspective\nII-1. State Capacity and Economic Development\nII-2. The Decline of Old China\nII-3. The Rise of New China and its Global Implications\nBrandt, Loren, Debin Ma, and Thomas G. Rawski. 2014.\nFrom Divergence to Convergence: Re-evaluating the History Behind China’s Economic Boom. Journal of Economic Literature\n, Vol. 52, No. 1, 45-123, March 2014.\nhttps://sites.pitt.edu/~tgrawski/papers/Brandt-Ma-Rawski%20From%20Divergence%20to%20Convergence%20JEL%20v52%20no1.pdf\nDincecco, Mark. 2015. The Rise of Effective States in Europe.\nThe Journal of Economic History\n, Vol. 75, Issue 3, 901-918, September 2015.\nhttps://www.cambridge.org/core/journals/journal-of-economic-history/article/rise-of-effective-states-in-europe/58E83BDDCDF22C28C24A1971EEBE69BB.\nFu, Xiaolan, Bruce McKern, and Jin Chen, eds. 2021.\nThe Oxford Handbook of China Innovation.\nNew York: Oxford University Press.\nKennedy, David and Joseph E. Stiglitz. 2013.\nLaw and Economics with Chinese Characteristics: Institutions for Promoting Development in the Twenty-first Century\n. United Kingdom: Oxford University Press.\nMaddison, Angus. 2007.\nContours of the World Economy, 1-2030 AD: Essays in Macro-economic History\n. New York: Oxford University Press.\nMen, Honghua. 2020.\nOn China’s Road: In Search of a New Modernity.\nSingapore: Springer Singapore.\nMorris, Ian. 2013.\nThe Measure of Civilization: How Social Development Decides the Fate of Nations\n. Princeton, New Jersey: Princeton University Press.\nParker, Geoffrey. 1996.\nThe Military Revolution: Military Innovation and the Rise of the West, 1500-1800.\nCambridge: Cambridge University Press.\nSpence, Jonathan D. 2013.\nThe Search for Modern China.\nNew York: W.W. Norton & Company.\nTilly, Charles. 1992.\nCoercion, Capital, and European States, AD 990-1992.\nCambridge. MA: Wiley-Blackwell.\nWang, Shaoguang. 2003.\nThe Problem of State Weakness. Journal of Democracy\n, 14(1), 36-42. doi:DOI 10.1353/jod.2003.0022\n王紹光，2020 ，《中國崛起的世界意義》，中國：中信出版社。\nWang, Shaoguang. 2021.\nChina’s Rise and Its Global Implications.\nSingapore: Springer Nature.\nII-4. “The March of the Volunteers”: The Birth of the National Anthem\nChina: A Century of Revolution (a documentary series by Ambrica Productions in association with WGBH Boston and Channel 4 Television UK; executive producer, Judith Vecchione; written, produced and directed by Sue Williams. United States: Zeitgeist Films c2007.) (CUHK library: UL DVD; DS774.C452 2007.)\nIII. One Country, Two Systems: Past and Present\nIII-1. The Constitution of New China\n韓大元主編，2019，《新中國憲法發展70年》，香港：三聯書店。\nIII-2. One Country, Two Systems: its Strategic Objectives and Core Features\n鄧小平， 2004，《鄧小平論「一國兩制」》，香港 : 三聯書店。\nLau, Siu-kai. 2021. Western misunderstandings of ‘one country, two systems’.\nChina Daily\n. 20 January 2021.\nhttps://www.chinadailyhk.com/article/155388#Western-misunderstandings-of-'one-country-two-systems\n劉兆佳， 2021，西方勢力對「一國兩制」和香港基本法的誤解和曲解， 《橙新聞》， 2021年1月16日。\nhttps://apps.orangenews.hk/app/common/details_html?contentId=148190\nLim, C. L. 2022.\nTreaty for a Lost City: The Sino-British Joint Declaration.\nCambridge, United Kingdom: Cambridge University Press.\n蘇力，2018，《大國憲制：歷史中國的制度構成》，北京：北京大學出版社。\nSu, Li. 2018.\nThe constitution of Ancient China\n, edited by Zhang, Yongle and Daniel Bell, trans. by Ryden Edmund. Princeton, NJ: Princeton University Press.\nIII-3. The Constitution of PRC, The Basic Law of HKSAR and “One Country, Two Systems”\nChen, Albert. 2018. The autonomy of Hong Kong under “One Country, Two Systems”, In\nRoutledge Handbook of Contemporary Hong Kong\n, edited by Lui, Tai-lok, Stephen W.K. Chiu and Ray Yep. London: Routledge.\nChen, Albert H.Y. 2021.\nThe Changing Legal Orders in Hong Kong and Mainland China: Essays on “One Country, Two Systems”\n. Hong Kong: City University of Hong Kong Press.\n韓大元，2022，1982年憲法的基本原則與變遷，《憲法、香港基本法與香港國安法十講》，陳弘毅、韓大元、楊曉楠主編，67-88頁，香港：中華書局。\n王振民，2014，《中央與特別行政區關係—一種法治結構的解釋》，香港：三聯書店。\n王叔平，1990，《香港特別行政區基本法導論》，中國：中共中央黨校出版社。\nhttps://julac-cuhk.primo.exlibrisgroup.com/permalink/852JULAC_CUHK/1dl2t2q/alma991004886719703407\nWang, Zhenmin. 2019.\nRelationship Between the Chinese Central Authorities and Regional Governments of Hong Kong and Macao: A Legal Perspective\n, 108-141; 269-276; 291-299. Singapore: Springer Singapore.\nRamsden, Michael and Hargreaves Stuart, eds. 2022.\nHong Kong Basic Law Handbook.\nHong Kong: Thomson Reuters Hong Kong Limited.\nThe State Council of the People’s Republic of China. 2021.\nHong Kong: Democratic Progress under the Framework of One Country, Two Systems\n. Retrieved from http://www.news.cn/english/2021-12/20/c_1310383195.htm\nIV. National Security in the Wider Constitutional Order\nIV-1A. Financial Security: Financial Stability of Hong Kong\nInternational Monetary Fund. 2022. People’s Republic of China-Hong Kong Special Administrative Region: 2022 Article IV Consultation Discussions-Press Release; and Staff Report.\nIMP Country Report No. 22/69\n, March 2022.\nhttps://www.imf.org/en/Publications/CR/Issues/2022/03/07/Peoples-Republic-of-China-Hong-Kong-Special-Administrative-Region-2022-Article-IV-513945\nIV-2. The Constitution and National Security\nCorn, Geoffrey S. Corn, Jimmy Gurulé, Jeffrey D. Kahn and Gary Corn. 2021.\nNational Security Law and the Constitution.\nSecond edition. New York: Wolters Kluwer.\nDycus, Stephen, William C. Banks and Peter Raven-Hansen, Stephen I. Vladeck. 2020.\nNational Security Law.\nNew York: Wolters Kluwer.\nGeiss, R., N. Melzer, J. G. Devaney and E. Methymaki. 2021.\nThe Oxford Handbook of the International Law of Global Security\n(First edition. ed.). Oxford, United Kingdom: Oxford University Press.\nGheciu, A. and W. C. Wohlforth. 2018.\nThe Oxford Handbook of International Security.\nUnited Kingdom: Oxford University Press.\nScott, Paul F. 2018.\nThe National Security Constitution.\nNew York: Hart Publishing.\n王振民、黃風、畢雁英等，2021，《香港特別行政區維護國家安全法讀本》，1-24頁；63-79頁；118-143頁，香港：三聯書店。\nIV-3. Law as Safeguard: General Principles of HKNSL\n陳弘毅等著，2020，《香港國家安全法解讀 : 立法與管治》，香港：中華書局。\n陳弘毅、韓大元、楊曉楠主編，2022，《憲法、香港基本法與香港國安法十講》，香港：中華書局。\n朱國斌、韓大元、王江雨、黃明濤主編，2021 ，《香港國家安全法：法理與實踐》，香港： 三聯書店。"
    }
  ]
}