{
  "metadata": {
    "scraped_at": "2025-08-14T08:30:58.067773+00:00",
    "subject": "ARTS",
    "total_courses": 11,
    "scraper_version": "memory-safe-v2.0"
  },
  "courses": [
    {
      "subject": "ARTS",
      "course_code": "1001",
      "title": "The Beauty of Kunqu Opera",
      "credits": "2.00",
      "terms": [],
      "description": "This course introduces students to the music, performance, literature and aesthetics of Kunqu opera in order to enhance their understanding of traditional Chinese culture, classical Chinese literature as well as performing arts. Selected scenes from Kunqu classics, such as The Peony Pavilion and The Palace of Eternal Youth will be analyzed and discussed before they are staged for appreciation. Under the teachers’ guidance, students will be able to experience the unity of song and dance as well as the artistic expression of emotions in the world of Kunqu opera.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "1002",
      "title": "From Tradition to Modernity: Selected Readings of 20th Century Chinese Culture",
      "credits": "3.00",
      "terms": [],
      "description": "The course is designed as a sequel to ARTS1000 (Classics of Chinese Humanities: Selected Readings) by focusing on a number of representative texts by famous Chinese intellectuals and writers. They bear witness to the mental deliberations of a generation—or two generations—caught between the forces of tradition and modernity as they found their way through the thicket of source materials from both Chinese and Western cultural traditions. Each author chooses to confront the legacies of Chinese tradition—literary, cultural, and intellectual—by subjecting them to a new reevaluation from modern perspectives derived from their newly acquired knowledge and/or experience from the West. Their modes of analysis have set a new intellectual and scholarly benchmark for later generations. In short, these texts have become modern “classics” in their own right.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "1003",
      "title": "Introduction to Chinese Classics",
      "credits": "3.00",
      "terms": [],
      "description": "This course aims at illustrating the relationship between Chinese classics texts and Chinese culture. Through discussions of important texts in Confucianism, Daoism and Buddhism, students can gain a deeper understanding of these philosophical schools and the underlying features of Chinese tradition, beliefs and values.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "1005",
      "title": "Introduction to Music and Philosophy",
      "credits": "3.00",
      "terms": [],
      "description": "This course introduces music and philosophy as intersecting practices through which human beings give meaning to the world around them. By exploring philosophy through music and music through philosophy from cross-cultural perspectives, the course exposes students to a variety of ways that knowledge, existence, religion, ethics, politics, culture, and sound converge.Rather than a comprehensive introduction to the fields of philosophy and music, this course uses a topical approach to explore several themes in these fields through discussion of selected musical examples and readings presented within an interdisciplinary framework. No background in music or philosophy is assumed or required.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Classwork Discussion Lecture",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "1007",
      "title": "Creative Cities and Urban Cultural Life",
      "credits": "3.00",
      "terms": [],
      "description": "Creative economy and cultural industries have been considered crucial strategies for driving the urban development of global cities. The dynamic landscape of the global cultural scene, where culture converges with the economy, community, heritage, and innovative technologies, has created an impetus for many cities to adopt innovative approaches in utilising urban spaces and cultural resources, enabling citizens to vividly reimagine their urban and cultural life. These approaches are envisioned as and manifested in the form of the development of large-scale urban regions and city clusters, where major cultural facilities such as museums, art districts, performance venues, and festivals significantly contribute to social well-being and intercultural dialogue.This course is designed to provide students with an opportunity to explore the interface between culture, urban space, and the economy with an eye towards the radically changing cultural landscape of Hong Kong. By offering students both theoretical knowledge and firsthand field experience, this course examines museums, galleries, and various cultural institutions as exemplary cases of how different forms of cultural activities can be turned into powerhouses of creative synergies and economic growth. By the end of the course, students will have gained insight into the complex relationships between the emerging phenomenon of creative cities and urban cultural life, as well as heritage and Chinese culture.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "1008",
      "title": "Take on Hong Kong: The Revitalisation and Interpretation of Hong Kong's Cultural Heritage",
      "credits": "3.00",
      "terms": [],
      "description": "This course explores cultural heritage definitions and relevant conceptualisations in the local context. It introduces the historical development of cultural heritage in the contemporary world. It then further discusses the current legal and policy framework of local heritage selection and conservation. It requires the students to reflect on what heritage is and how heritage shall be selected and defined. Through various local case studies, students will explore the social relation between cultural heritage and the local community. They will debate how cultural heritage shall be interpreted from a local perspective but could be operated sustainably.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Field Studies/Field-trip Lecture",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "1010",
      "title": "LLMs for Language Studies",
      "credits": "3.00",
      "terms": [
        {
          "term_code": "2380",
          "term_name": "2025-26 Term 1",
          "schedule": [
            {
              "section": "--LEC (5033)",
              "meetings": [
                {
                  "time": "Tu 2:30PM - 4:15PM",
                  "location": "William M W Mong Eng Bldg 712",
                  "instructor": "Professor CAI Zhenguang",
                  "dates": "2/9, 9/9, 16/9, 23/9, 30/9"
                },
                {
                  "time": "Tu 2:30PM - 4:15PM",
                  "location": "William M W Mong Eng Bldg 712",
                  "instructor": "Professor CAI Zhenguang",
                  "dates": "14/10, 21/10, 28/10, 4/11, 11/11, 18/11, 25/11"
                }
              ],
              "availability": {
                "capacity": "50",
                "enrolled": "10",
                "waitlist_capacity": "999",
                "waitlist_total": "0",
                "available_seats": "40",
                "status": "Open"
              },
              "class_attributes": "English only"
            },
            {
              "section": "-T01-TUT (5034)",
              "meetings": [
                {
                  "time": "Tu 4:30PM - 5:15PM",
                  "location": "William M W Mong Eng Bldg 712",
                  "instructor": "Professor CAI Zhenguang",
                  "dates": "2/9, 9/9, 16/9, 23/9, 30/9"
                },
                {
                  "time": "Tu 4:30PM - 5:15PM",
                  "location": "William M W Mong Eng Bldg 712",
                  "instructor": "Professor CAI Zhenguang",
                  "dates": "14/10, 21/10, 28/10, 4/11, 11/11, 18/11, 25/11"
                }
              ],
              "availability": {
                "capacity": "50",
                "enrolled": "10",
                "waitlist_capacity": "999",
                "waitlist_total": "0",
                "available_seats": "40",
                "status": "Open"
              },
              "class_attributes": "English only"
            }
          ]
        }
      ],
      "description": "This course explores the applications of Large Language Models (LLMs) in language-related disciplines, including linguistics, translation, language learning, and academic writing. Students will gain hands-on experience in utilizing LLMs for research and practical tasks through Python programming. No prior knowledge of programming is required.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Undergraduate",
      "grading_basis": "Graded",
      "component": "Lecture Interactive Tutorial",
      "campus": "Main Campus",
      "academic_group": "Fac Office of Arts",
      "academic_org": "Fac Office of Arts"
    },
    {
      "subject": "ARTS",
      "course_code": "6000",
      "title": "Reconnections: Studying China across humanistic disciplines",
      "credits": "3.00",
      "terms": [],
      "description": "The state of humanities in academia the world over is in crisis. Part of the crisis is caused by global trends toward financial and technological capitalism, but the other part of the problem has to be sought in the humanistic disciplines themselves. Over-specialization in research, fragmentation among and within disciplines, the pressure of utilitarian goals (such as grant-getting for faculty promotion and practical job-orientation for students) are but some of the manifestations obvious to all. How to remedy the situation? Short of an institutional overhaul, we might begin from our own academic base, humanities departments under the Faculty of Arts.From an academic point of view, over-specialization in the humanities departments results in scholars working in narrow and isolated fields without interaction with colleagues in other departments and fields. The study of China also suffers from such an academic trend, which results in fragmentary studies of narrowly defined topics that fail to connect with each other and with the larger background. A further problem, particularly evident in some humanities fields, is the over-reliance on Western theory, which is applied to Chinese data without reflection or mediation. Certain theoretical excesses, as exemplified in the work of Michel Foucault and other poststructuralist theorists, have led to a general distrust of the human subject itself. Indeed, even the word “humanities” has lost its meaning. This seminar is designed to explore new ways of making “connections” or “reconnections” across various disciplines and theoretical domains, it is broadly-based by design and all-inclusive in content. It is also intended to serve as a general forum for faculty-student discussion so as to provide a stimulus for humanistic scholarship and future research.",
      "enrollment_requirement": "",
      "course_attributes": "",
      "academic_career": "Postgraduate - Research",
      "grading_basis": "Graded",
      "component": "Practicum",
      "campus": "Main Campus",
      "academic_group": "Faculty Office of Arts (PG)",
      "academic_org": "Faculty Office of Arts (PG)"
    },
    {
      "subject": "ARTS",
      "course_code": "6002",
      "title": "Advanced Studies in the Humanities",
      "credits": "3.00",
      "terms": [
        {
          "term_code": "2380",
          "term_name": "2025-26 Term 1",
          "schedule": [
            {
              "section": "--LEC (2870)",
              "meetings": [
                {
                  "time": "We 2:30PM - 5:15PM",
                  "location": "Fung King Hey Bldg 220",
                  "instructor": "Staff",
                  "dates": "3/9, 10/9, 17/9, 24/9"
                },
                {
                  "time": "We 2:30PM - 5:15PM",
                  "location": "Fung King Hey Bldg 220",
                  "instructor": "Staff",
                  "dates": "8/10, 15/10, 22/10"
                },
                {
                  "time": "We 2:30PM - 5:15PM",
                  "location": "Fung King Hey Bldg 220",
                  "instructor": "Staff",
                  "dates": "5/11, 12/11, 19/11, 26/11"
                }
              ],
              "availability": {
                "capacity": "20",
                "enrolled": "8",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "12",
                "status": "Open"
              },
              "class_attributes": "English only"
            }
          ]
        },
        {
          "term_code": "2390",
          "term_name": "2025-26 Term 2",
          "schedule": [
            {
              "section": "--LEC (4505)",
              "meetings": [
                {
                  "time": "We 2:30PM - 5:15PM",
                  "location": "Basic Med Sci Bldg Rm2",
                  "instructor": "Staff",
                  "dates": "7/1, 14/1, 21/1, 28/1, 4/2, 11/2"
                },
                {
                  "time": "We 2:30PM - 5:15PM",
                  "location": "Basic Med Sci Bldg Rm2",
                  "instructor": "Staff",
                  "dates": "25/2, 4/3, 11/3, 18/3, 25/3, 1/4, 8/4, 15/4"
                }
              ],
              "availability": {
                "capacity": "20",
                "enrolled": "5",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "15",
                "status": "Open"
              },
              "class_attributes": "English only"
            }
          ]
        }
      ],
      "description": "This course provides an opportunity for students to be exposed to current developments in specific areas of the Humanities. The topics vary according to the research expertise of the staff or visiting academics.Course content and format is determined by the instructor(s).Students are allowed to take the above course more than once and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.",
      "enrollment_requirement": "For students in Research Postgraduate Programmes under Faculty of Arts",
      "course_attributes": "",
      "academic_career": "Postgraduate - Research",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Faculty Office of Arts (PG)",
      "academic_org": "Faculty Office of Arts (PG)"
    },
    {
      "subject": "ARTS",
      "course_code": "7001",
      "title": "Performing Public Humanities",
      "credits": "3.00",
      "terms": [],
      "description": "Performing Public Humanities explores the ongoing questions and stakes of cultivating a public-facing humanities today, with a focus on performance as advocacy and action. As such, this course examines public humanities through performance, and simultaneously highlights the work of universities and cultural nonprofits across a variety of contexts, collaborations, and communities. RPg students come together for co-creative research that crisscrosses performance and public human inquiry, with the aim of fostering socially engaged thinking that cuts across disciplinary modes of interrogation.This course does not require prior performing experience or knowledge.",
      "enrollment_requirement": "For students enrolled in Research Postgraduate Programmes in the Faculty of Arts.",
      "course_attributes": "",
      "academic_career": "Postgraduate - Research",
      "grading_basis": "Graded",
      "component": "Lecture",
      "campus": "Main Campus",
      "academic_group": "Faculty Office of Arts (PG)",
      "academic_org": "Faculty Office of Arts (PG)"
    },
    {
      "subject": "ARTS",
      "course_code": "7002",
      "title": "Digital Methods for Humanities Research",
      "credits": "3.00",
      "terms": [
        {
          "term_code": "2390",
          "term_name": "2025-26 Term 2",
          "schedule": [
            {
              "section": "--LEC (2227)",
              "meetings": [
                {
                  "time": "Th 2:30PM - 4:15PM",
                  "location": "TBA",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "8/1, 15/1"
                },
                {
                  "time": "Th 2:30PM - 4:15PM",
                  "location": "TBA",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "29/1, 5/2, 12/2"
                },
                {
                  "time": "Th 2:30PM - 4:15PM",
                  "location": "TBA",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "26/2, 5/3, 12/3, 19/3, 26/3, 2/4, 9/4, 16/4"
                },
                {
                  "time": "Th 2:30PM - 4:15PM",
                  "location": "T.C. Cheng Bldg 102",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "22/1"
                }
              ],
              "availability": {
                "capacity": "20",
                "enrolled": "14",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "6",
                "status": "Open"
              },
              "class_attributes": "English only"
            },
            {
              "section": "-T01-TUT (2228)",
              "meetings": [
                {
                  "time": "Th 4:30PM - 5:15PM",
                  "location": "TBA",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "8/1, 15/1"
                },
                {
                  "time": "Th 4:30PM - 5:15PM",
                  "location": "TBA",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "29/1, 5/2, 12/2"
                },
                {
                  "time": "Th 4:30PM - 5:15PM",
                  "location": "TBA",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "26/2, 5/3, 12/3, 19/3, 26/3, 2/4, 9/4, 16/4"
                },
                {
                  "time": "Th 4:30PM - 5:15PM",
                  "location": "T.C. Cheng Bldg 102",
                  "instructor": "Professor Stuart Michael MCMANUS",
                  "dates": "22/1"
                }
              ],
              "availability": {
                "capacity": "20",
                "enrolled": "14",
                "waitlist_capacity": "0",
                "waitlist_total": "0",
                "available_seats": "6",
                "status": "Open"
              },
              "class_attributes": "English only"
            }
          ]
        }
      ],
      "description": "The use of digital methods in research is growing rapidly in many fields in the humanities from China Studies to archaeology. This course introduces students to the exciting world of digital humanities, including text mining (text), digital analysis of images (image), and 3-D scanning and printing (object). These are skills that can be used to gain insights from texts written in Chinese, English and other languages, paintings, engravings or statuary, as well as historical artefacts. Students will be able to apply what they learn in this course to a range of questions in the humanities. It will also be useful in a variety of future careers in both the academic and applied humanities. This is an introductory postgraduate course and no background in digital humanities is required. The class will meet in the Digital Scholarship Lab of the University Library and will culminate in a group project (website) that students can add to their portfolios.",
      "enrollment_requirement": "For students enrolled in Research Postgraduate Programmes in the Faculty of Arts.",
      "course_attributes": "",
      "academic_career": "Postgraduate - Research",
      "grading_basis": "Graded",
      "component": "Lecture Interactive Tutorial",
      "campus": "Main Campus",
      "academic_group": "Faculty Office of Arts (PG)",
      "academic_org": "Faculty Office of Arts (PG)"
    }
  ]
}